Repository: mythter/mura
Catalog: po/*.po
Languages: ru

source: Summary
ru: Краткое содержание

source: Branches
ru: Ветки

source: Changes
ru: Изменения

source: Commits
ru: Коммиты

source: Config
ru: Конфигурация

source: Line endings
ru: Окончания строк

source: Log
ru: Лог

source: Remotes
ru: Удалённые репозиотрии

source: Stash
ru: Припрятывание

source: Tags
ru: Теги

source: Worktrees
ru: Рабочие деревья

source: Useful commands
ru: Полезные команды

source: Shortcuts
ru: Горячие клавиши

source: Some useful links
ru: Полезные ссылки

source: [Git Cheatsheet](https://ndpsoftware.com/git-cheatsheet.html)
ru: [Git шпаргалка](https://ndpsoftware.com/git-cheatsheet.html)

source: [Cheatsheet from http://training.github.com/](https://training.github.com/downloads/github-git-cheat-sheet/)
ru: [Шпаргалка от http://training.github.com/](https://training.github.com/downloads/github-git-cheat-sheet/)

source: [Pro Git book (2nd Edition)](https://git-scm.com/book/en/v2)
ru: [Книга Pro Git (2-е издание)](https://git-scm.com/book/ru/v2)

source: CREATE
ru: СОЗДАНИЕ

source: Create a branch
ru: Создать ветку

source: Create a branch and switch to it
ru: Создать ветку и переключиться на неё

source: common
ru: обычная команда

source: new
ru: новая команда

source: If there is a remote branch, but you need to create a local one and link to the remote one
ru: Если есть удалённая ветка, но вам нужно создать локальную и привязаться к удаленной

source: If there is already a local one with the same name, then it will link to the remote one
ru: Если локальная ветка с таким именем уже существует, то она будет отслеживать удалённую

source: If there is a local branch and you need to create a remote one with tracking
ru: Если есть локальная ветка и вам нужно создать удалённую с отслеживанием

source: If there are both local and remote branches and you need to make tracking
ru: Если есть как локальная, так и удалённая ветки и вам необходимо связать их

source: If you need to remove tracking
ru: Если вам нужно удалить отслеживание

source: MOVE
ru: ПЕРЕМЕЩЕНИЕ

source: Move branch pointer to a different commit (_destination-commit_ can be a branch name)
ru: Переместить указатель ветки на другой коммит (_destination-commit_ может быть названием ветки)

source: DELETE
ru: УДАЛЕНИЕ

source: DELETE remote branch (_remote-name_ usually _origin_)
ru: УДАЛИТЬ удалённую ветку (_remote-name_ обычно _origin_)

source: Don't forget to do a `git fetch --all --prune` or `git fetch --all -p` on other machines after deleting the remote branch on the server. After deleting the local branch with `git branch -d` and deleting the remote branch with `git push -d origin` other machines may still have "obsolete tracking branches" (to see them do `git branch -a`). To get rid of these do `git fetch --all --prune`
ru: Не забудьте выполнить `git fetch --all --prune` или `git fetch --all -p` на других машинах после удаления удалённой ветки на сервере. После удаления локальной ветки с помощью `git branch -d` и удаления удалённой ветки с помощью `git push -d origin` на других машинах могут остаться "устаревшие отслеживаемые ветки" (чтобы увидеть их, выполните `git branch -a`). Чтобы избавиться от них, выполните `git fetch --all --prune`

source: DELETE local branch
ru: УДАЛИТЬ локальную ветку

source: The _\-D_ option is an alias for _\--delete_ _\--force_, which deletes the branch "irrespective of its merged status"
ru: Опция _\-D_ это алиас для _\--delete_ _\--force_, который удаляет ветку «независимо от её объединенного статуса (merged status)»

source: DELETE local remote-tracking branch
ru: УДАЛИТЬ локальную удалённую ветку

source: long
ru: длинная команда

source: RENAME
ru: ПЕРЕИМЕНОВАНИЕ

source: Rename current branch
ru: Переименовать текущую ветку

source: Rename another branch
ru: Переименовать другую ветки

source: Rename the branch on the remote
ru: Переименовать удалённую ветки

source: or
ru: или

source: Push the local branch and reset the upstream branch
ru: Отправить локальную ветку на удалённый репозиторий и обновить отслеживаемую ветку

source: Delete the remote branch
ru: Удалить удалённую ветку

source: VIEW
ru: ПРОСМОТР

source: View branches that was merged with the current branch
ru: Просмотреть ветки, которые были объединены с текущей веткой

source: View remote branches that was merged with the current branch
ru: Просмотреть удалённые ветки, которые были объединены с текущей веткой

source: View branches that was't merged with the current branch
ru: Просмотреть ветки, которые не были объединены с текущей веткой

source: PRUNE
ru: УДАЛЕНИЕ УСТАРЕВШИХ ВЕТОК

source: short
ru: короткая команда

source: STAGE
ru: ИНДЕКСИРОВАНИЕ

source: Stage all changes
ru: Индексировать все изменения

source: Stage changes in interactive mode
ru: Индексировать все изменения в интерактивном режиме

source: Stage changes in patch mode
ru: Индексировать все изменения в патч режиме

source: UNSTAGE
ru: УДАЛЕНИЕ ИЗ ИНДЕКСА

source: Unstage some changes (MOVE from Index (staging area) to Workspace)
ru: Удалить изменения из Индекса (ПЕРЕМЕСТИТЬ из Индекса в Рабочую директорию)

source: old
ru: старая команда

source: Unstage all changes
ru: Удалить изменения в Индексе

source: Delete changes in Workspace
ru: Удалить изменения в Рабочей директории

source: Delete all changes in Workspace
ru: Удаление всех изменений из Рабочей директории

source: Delete all changes in Index and Workspace
ru: Удаление изменений из Индекса и Рабочей директории

source: REMOVE FROM GIT
ru: УДАЛИТЬ ИЗ GIT

source: Remove file from Git tracking but keep it on disk
ru: Удалить файл из отслеживания Git, но оставить на диске

source: Remove file from the git repository and from the local disk
ru: Удалить файл из репозитория Git и с диска

source: Make an empty commit
ru: Создать пустой коммит

source: ```shell git commit --allow-empty -m "empty commit" ```
ru: ```shell git commit --allow-empty -m "пустой коммит" ```

source: Undo the last commit and move changes to Working Directory (changes in staging area will also move to Working Directory) (_\--mixed_ by default)
ru: Отменить последний коммит и переместить изменения в Рабочую директорию (изменения в Индексе также будут перенесены в Рабочую директорию) (по умолчанию _\--mixed_)

source: Undo the last commit and move changes to the Index
ru: Отменить последний коммит и переместить изменения в Индексе

source: Undo the last commit and move changes to the Working Directory
ru: Отменить последний коммит и переместить изменения в Рабочую директорию

source: Undo the last commit and DELETE changes (uncommitted ones too)
ru: Отменить последний коммит и УДАЛИТЬ изменения (не закоммиченные тоже)

source: Copy one commit to current branch
ru: Копировать один коммит в текущую ветку

source: Copy range of commits to current branch
ru: Копировать диапазон коммитов в текущую ветку

source: Open global config file for editing
ru: Открыть глобальную конфигурацию для редактирования

source: Show global config file content in terminal
ru: Просмотреть файл глобальной конфигурации в терминале

source: Configure name and email
ru: Конфигурация имени и email

source: ```shell git config --global user.name "Your Name" ```
ru: ```shell git config --global user.name "Ваше Имя" ```

source: The `git config core.autocrlf` command is used to change how Git handles line endings. It takes a single argument.
ru: Команда `git config core.autocrlf` используется для изменения того, как Git обрабатывает окончания строк. Она принимает один аргумент.

source: When to Use
ru: Когда использовать

source: Single platform
ru: Единственная платформа

source: Filter
ru: Фильтр

source: By number
ru: По номеру

source: By date
ru: По дате

source: By author
ru: По автору

source: ```shell git log --author="Name" ```
ru: ```shell git log --author="Имя" ```

source: By commit message pattern
ru: По паттерну сообщения коммита

source: ```shell git log --grep="pattern" ```
ru: ```shell git log --grep="паттерн" ```

source: By commits range
ru: По диапазону коммитов

source: By file name (only shows commits that changed that file)
ru: По имени файла (показываются только коммиты, в которых изменялся файл)

source: Decoration
ru: Декорирование

source: Print commit with the names of changed files
ru: Показать коммит с именами изменённых файлов

source: Add remote
ru: Добавить удалённый репозиторий

source: Change remote
ru: Изменить удалённый репозиторий

source: View remote
ru: Просмотреть удалённый репозиторий

source: View remote name
ru: Добавить имя удалённого репозитория

source: View remote name and url
ru: Просмотреть имя и URL удалённого репозитория

source: View more info about remote
ru: Просмотреть больше информации об удалённом репозитории

source: Delete remote
ru: Удалить удалённый репозиторий

source: Change remote in local repository
ru: Изменить ссылку удалённого репозитория

source: ```shell git config user.name "Your name" ```
ru: ```shell git config user.name "Ваше имя" ```

source: Commands
ru: Команды

source: SAVE
ru: СОХРАНЕНИЕ

source: ```shell git stash push -m "message" ```
ru: ```shell git stash push -m "сообщение" ```

source: ```shell git stash save "message" ```
ru: ```shell git stash save "сообщение" ```

source: EJECT
ru: ИЗВЛЕЧЕНИЕ

source: Get content from stash (and delete from there)
ru: Извлечь содержимое из тайника (и удалить из него)

source: Get content from stash (and leave it there)
ru: Извлечь содержимое из тайника (и оставить его там же)

source: Create lightweight tag
ru: Создать облегчённый тег

source: Create annotated tag
ru: Создать тег с аннотацией

source: ```shell git tag -am "message" <tag_name> <SHA> ```
ru: ```shell git tag -am "сообщение" <tag_name> <SHA> ```

source: Create a remote tag when local exists
ru: Создать удалённый тег, когда существует локальный

source: Push all local tags to remote
ru: Отправить все локальные теги на удалённый репозиотрий

source: View tag info
ru: Просмотреть информацию о теге

source: View tags list
ru: Просмотреть список тегов

source: View tags list by pattern
ru: Просмотреть список тегов по паттерну

source: ```shell git tag -l "pattern" ```
ru: ```shell git tag -l "паттерн" ```

source: View tags list with first line of each annotation
ru: Просмотреть список тегов с первой строкой каждой аннотации

source: Delete local tag
ru: Удалить локальный тег

source: Delete remote tag
ru: Удалить удалённый тег

source: Create a worktree for an existing branch using the same name as the working directory
ru: Создать рабочее дерево для существующей ветки используя такое имя рабочей директории

source: Create a worktree for an existing branch using a different name than the working directory
ru: Создать рабочее дерево для существующей ветки используя имя отличное от рабочей директории

source: Create a worktree with a new branch using the same name as the working directory
ru: Создать рабочее дерево с новой веткой используя такое имя рабочей директории

source: Create a worktree with a new branch using a different name than the working directory
ru: Создать рабочее дерево с новой веткой используя имя отличное от рабочей директории

source: Show all worktrees
ru: Показать все рабочие деревья

source: Remove a worktree
ru: Удалить рабочее дерево

source: or [(link)](https://stackoverflow.com/questions/39707402/why-does-git-worktree-add-create-a-branch-and-can-i-delete-it)
ru: или [(ссылка)](https://stackoverflow.com/questions/39707402/why-does-git-worktree-add-create-a-branch-and-can-i-delete-it)

source: Useful Git Commands
ru: Полезные команды Git

source: Show the branch on which a specific commit was originally created
ru: Показать ветку, на которой изначально был создан определенный коммит

source: Visual Studio Main Shortcuts
ru: Основные горячие клавиши Visual Studio

source: Editing
ru: Редактирование

source: `Ctrl+K,C` – comment line `Ctrl+K,U` – uncomment line `Ctrl+D` – duplicate line `Ctrl+Shift+L` – delete line without adding it to the clipboard `Alt+<Up/Down arrows>` – move line up/down
ru: `Ctrl+K,C` – закомментировать строку `Ctrl+K,U` – раскомментировать строку `Ctrl+D` – продублировать строку `Ctrl+Shift+L` – удалить строку, не добавляя её в буфер обмена `Alt+<Up/Down arrows>` – переместить строку вверх/вниз

source: `Ctrl+K,F` – format the selected block `Ctrl+K,D` – format the entire file `Ctrl+K,E` – clean up the code in the file (according to the rules you set, for example, removing unnecessary usings)
ru: `Ctrl+K,F` – отформатировать выделенный блок `Ctrl+K,D` – отформатировать весь файл `Ctrl+K,E` – очистка кода в файле (по заданным вами правилам, например, удаление ненужных using)

source: `Ctrl+K,S` – insert snippet (if, try, for block, etc.), or enclose the selected code in a block `Alt+Shift+<arrows>` (`Alt+<mouse selection>`) – edit by columns `Ctrl+Alt+<place the cursor with the mouse>` – multi-cursor input (edit in several places at once)
ru: `Ctrl+K,S` – вставка сниппета (блок if, try, for и т.п.), либо заключить выделенный код в блок `Alt+Shift+<стрелки>` (`Alt+<выделение мышью>`) - редактирование по колонкам `Ctrl+Alt+<поместить курсор мышью>` - многокурсорный ввод (редактирование в нескольких местах одновременно)

source: Navigation
ru: Навигация

source: `Ctrl+G` – go to line `Ctrl+K,K` – leave bookmark `Ctrl+K,N` – go to next bookmark
ru: `Ctrl+G` – перейти к линии `Ctrl+K,K` – оставить закладку `Ctrl+K,N` – перейти к следующей закладке

source: `Ctrl+,` (`Ctrl+T`) – search by code in project `Ctrl+Q` – search by IDE tools
ru: `Ctrl+,` (`Ctrl+T`) - поиск по коду в проекте `Ctrl+Q` – поиск по инструментам IDE

source: `F12` (`Ctrl+<mouse click>`) – go to definition `Alt+F12` – peek definition (definition hint in inline window) `Ctrl+F12` – go to implementation `Shift+F12` – find all references
ru: `F12` `(Ctrl+<щелчок мыши>)` – перейти к определению `Ctrl+F12` – перейти к реализации `Alt+F12` – подсказка реализации во всплывающем окне `Shift+F12` – найти использования

source: `Ctrl+Shift+space` – method arguments hint `Ctrl+[,S` – mark current file in solution explorer `Ctrl+;` – search in solution explorer
ru: `Ctrl+Shift+пробел` – подсказка по аргументам метода `Ctrl+[,S` – отметить текущий файл в обозревателе решения `Ctrl+;` - поиск в обозревателе решения

source: `Ctrl+M,O` – collapse all methods to definitions `Ctrl+M,P` – expand all methods `Ctrl+M,M` – collapse/expand the current method `Ctrl+M,L` – collapse/expand all outlining
ru: `Ctrl+M,O` - свернуть все методы `Ctrl+M,P` - развернуть все методы `Ctrl+M,M` – свернуть/развернуть текущий метод `Ctrl+M,L` – свернуть/развернуть все блоки кода

source: `Shift+Alt+.` – Add the next matching text as a selection `Shift+Alt+;` – Add all matching text as selections `Shift+Alt+,` – Remove last selected occurrence `Shift+Alt+/` – Skip next matching occurrence
ru: `Shift+Alt+.` – Добавить следующий совпадающий текст как выделение `Shift+Alt+;` – Добавить весь совпадающий текст как выделение `Shift+Alt+,` – Удалить последнее выбранное вхождение `Shift+Alt+/` – Пропустить следующее совпадающее вхождение

source: **For ASP.NET** `Ctrl+M,G` – go from a controller method to a view or vice versa
ru: **Для ASP.NET** `Ctrl+M,G` – перейти из метода контроллера в представление или наоборот

source: Refactoring
ru: Рефакторинг

source: `Ctrl+.` (`Alt+Enter`) – refactoring hints `Ctrl+R,R` – rename `Ctrl+R,M` – extract selected code to method `Ctrl+R,I` – extract interface from class `Ctrl+R,V` (`Ctrl+R,O`) – reorganize method parameters
ru: `Ctrl+.` (`Alt+Enter`) – подсказки рефакторинга `Ctrl+R,R` – переименовать `Ctrl+R,M` – извлечь выделенный код в метод `Ctrl+R,I` - извлечь интерфейс из класса `Ctrl+R,V` (`Ctrl+R,O`) - реорганизовать параметры метода

source: Snippets
ru: Сниппеты

source: `"prop",Tab,Tab` – create a property `"ctor",Tab,Tab` – create a constructor Tab,Tab also works for other popular keywords (if, for, switch, etc.)
ru: `"prop",Tab,Tab` – создать свойство `"ctor",Tab,Tab` – создать конструктор Также Tab,Tab работает для других популярных ключевых слов (if, for, switch и т.п.)

source: Debugging
ru: Отладка

source: `F9` – create a breakpoint `Ctrl+Alt+B` – open window with all breakpoints `Ctrl+Shift+F9` – delete all breakpoints
ru: `F9` – создать точку останова `Ctrl+Alt+B` – окно со всеми точками останова `Ctrl+Shift+F9` – удалить все точки останова
